Revit 2026 API

# BaseExportOptionsSetExportFontTable Method

---

Sets font table to option.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetExportFontTable(
	ExportFontTable fontTable
)
```
```vb
Public Sub SetExportFontTable (
	fontTable As ExportFontTable
)
```
```cpp
public:
void SetExportFontTable(
	ExportFontTable^ fontTable
)
```
```fsharp
member SetExportFontTable :
        fontTable : ExportFontTable -> unit
```

#### Parameters

fontTable ExportFontTable
     The font table to be set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

BaseExportOptions Class

Autodesk.Revit.DB Namespace